##Heroes Of Pymoli Data Analysis

### Observations :

1. From the Age groups analysis, it can be concluded that Age groups between 21 to 24 yrs of age has MAXIMUM purchase Value of $696.09

2. From Item analysis, it can be concluded that Item "Arcane Gem" & "Betrayal, Whisper of Grieving Widow" are the most popular games out of all games and they were purchased for 11 times

3. Retribution Axe is the most profitable out of games with a total value of $37.26

In [462]:
import pandas as pd
import numpy as np

df_players = pd.read_json("purchase_data.json")

**Players Count**

In [473]:
players_count = pd.DataFrame(df_players["SN"]).nunique().reset_index(name = "Total Players")
players_count

  index  Total Players
0    SN            573

**Purchasing Analysis (Total)**

In [475]:
players_items = pd.DataFrame(df_players["Item ID"]).nunique().reset_index(name = "Number of unique items ")
players_items

     index  Number of unique items
0  Item ID                      183

In [477]:
average_price = pd.DataFrame(df_players["Price"]).mean().reset_index(name = "Average Purchase Price ")
average_price

   index  Average Purchase Price
0  Price                 2.931192

In [494]:
total_purchases = pd.DataFrame(df_players["Price"]).count().reset_index(name = "Total Number of Purchases")
total_purchases

   index  Total Number of Purchases
0  Price                        780

In [482]:
total_revenue = pd.DataFrame(df_players["Price"]).sum().reset_index(name = "Total Revenue")
total_revenue
round(total_revenue,2)

   index  Total Revenue
0  Price        2286.33

## Gender Demographics

#### Percentage and Count of Male Players

In [497]:
total_male_counts = df_players[df_players["Gender"] == "Male"]["SN"].nunique()

perc_of_male = total_male_counts/df_players["SN"].nunique()*100

print(total_male_counts)
print('{:.2f}%'.format(perc_of_male))
print(str(round(perc_of_male,2))+"%")

465
81.15%
81.15%

#### Percentage and Count of Female Players

In [428]:
total_female_counts = df_players[df_players["Gender"]== "Female"]["SN"].nunique()
perc_of_female = total_female_counts/df_players["SN"].nunique()*100

print(total_female_counts)
print('{:.2f}%'.format(perc_of_female))
print(str(round(perc_of_female,2))+"%")

100
17.45%
17.45%

#### Percentage and Count of Other / Non-Disclosed

In [519]:
other_counts = df_players[~df_players["Gender"].isin(['Male', "Female"])]["SN"].nunique()
perc_of_other = other_counts / df_players["SN"].nunique()*100
print(other_counts)
print('{:.2f}%'.format(perc_of_other))

8
1.40%

## Purchasing Analysis (Gender)

In [522]:
Total_price_by_Gender = pd.DataFrame(df_players.groupby("Gender")["Price"].sum())
Total_price_by_Gender

                         Price
Gender
Female                  382.91
Male                   1867.68
Other / Non-Disclosed    35.74

In [525]:
Avg_price_by_Gender = pd.DataFrame(df_players.groupby("Gender")["Price"].mean().reset_index(name = "Avg. price"))
Avg_price_by_Gender

                  Gender  Avg. price
0                 Female    2.815515
1                   Male    2.950521
2  Other / Non-Disclosed    3.249091

## Age Demographics

In [504]:
###Adding new_col first to divide in to age groups###
max_age = df_players["Age"].max()
max_age
bins = np.arange(0,49,4)
bins
groups = ["0 to 4","5 to 8","9 to 12","13 to 16","17 to 20","21 to 24","25 to 28","29 to 32","33 to 36","37 to 40","41 to 44","45 to 48"]
groups
df_players["age_groups"] = pd.cut(df_players["Age"], bins, labels=groups)
df_players.head()

,Age,Gender,Item ID,Item Name,Price,SN,age_groups
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34,37 to 40
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46,21 to 24
2,34,Male,174,Primitive Blade,2.46,Assastnya25,33 to 36
3,21,Male,92,Final Critic,1.36,Pheusrical25,21 to 24
4,23,Male,63,Stormfury Mace,1.27,Aela59,21 to 24

In [542]:
df_gender_price = pd.DataFrame(df_players.groupby(["age_groups"])["Price"].sum().reset_index(name = "Total Purchase Value"))
df_gender_price

   age_groups  Total Purchase Value
0      0 to 4                   NaN
1      5 to 8                 61.34
2     9 to 12                 81.25
3    13 to 16                238.89
4    17 to 20                468.03
5    21 to 24                696.09
6    25 to 28                309.37
7    29 to 32                202.09
8    33 to 36                113.28
9    37 to 40                107.35
10   41 to 44                  5.92
11   45 to 48                  2.72

In [541]:
df_gender_count = pd.DataFrame(df_players.groupby(["age_groups"])["Price"].count().reset_index(name = "Purchase count"))
df_gender_count

   age_groups  Purchase count
0      0 to 4               0
1      5 to 8              22
2     9 to 12              24
3    13 to 16              87
4    17 to 20             161
5    21 to 24             238
6    25 to 28             104
7    29 to 32              66
8    33 to 36              38
9    37 to 40              37
10   41 to 44               2
11   45 to 48               1

### Normalised Totals

In [546]:
Normalized_totals = age_groups["Price"].sum() / age_groups["SN"].nunique()
df_Normalized_totals = pd.DataFrame(Normalized_totals)
df_Normalized_totals

                 0
new_col
0 to 4         NaN
5 to 8    4.718462
9 to 12   4.513889
13 to 16  3.732656
17 to 20  3.900250
21 to 24  3.742419
25 to 28  4.124933
29 to 32  4.592955
33 to 36  4.045714
37 to 40  4.879545
41 to 44  2.960000
45 to 48  2.720000

### Top Spenders

In [527]:
# price_of_players = df_players["Price"]
top_spenders_SN = pd.DataFrame(df_players.groupby('SN')["Price"].sum().sort_values(ascending = False).head(5)).reset_index()
top_spenders_SN
# top_spenders["Purchase count"] = pd.DataFrame(df_players['SN'](df_players['SN'] == top_spenders['SN'].count()).reset_index()

top_spenders_count = pd.DataFrame(df_players[df_players['SN'].isin(top_spenders_SN['SN'])].groupby('SN')['SN'].count().reset_index(name = 'Purchase Count'))
top_spenders_count

                                    
top_spenders_final = pd.merge(top_spenders,top_spenders_count,on = "SN")
top_spenders_final['Average Purchase Price'] = top_spenders_3["Price"]/top_spenders_3["Purchase Count"]
top_spenders_final
# type(top_spenders_3)

            SN  Price  Purchase Count  Average Purchase Price
0  Undirrala66  17.06               5                3.412000
1     Saedue76  13.56               4                3.390000
2  Mindimnya67  12.74               4                3.185000
3   Haellysu29  12.73               3                4.243333
4       Eoda93  11.58               3                3.860000

### Most Popular Item

In [441]:
###Most Popular Items**
df_players_popular = pd.DataFrame(df_players.groupby(["Item ID","Item Name","Price"])["Item ID"].count().sort_values(ascending = False).head(5).reset_index(name = "Total Count"))
df_players_popular["Purchase Value"] = df_players_popular["Price"]*df_players_popular["Total Count"]
df_players_popular

,Item ID,Item Name,Price,Total Count,Purchase Value
0,84,Arcane Gem,2.23,11,24.53
1,39,"Betrayal, Whisper of Grieving Widows",2.35,11,25.85
2,31,Trickster,2.07,9,18.63
3,34,Retribution Axe,4.14,9,37.26
4,175,Woeful Adamantite Claymore,1.24,9,11.16

   ### Most Profitable item

In [461]:
df_players_profitable = pd.DataFrame(df_players.groupby(["Item ID","Item Name","Price"])["Price"].sum().sort_values(ascending = False).head(5).reset_index(name = "Total Value"))
df_players_profitable

   Item ID                   Item Name  Price  Total Value
0       34             Retribution Axe   4.14        37.26
1      115  Spectral Diamond Doomblade   4.25        29.75
2       32                     Orenmir   4.95        29.70
3      103              Singed Scalpel   4.87        29.22
4      107   Splitter, Foe Of Subtlety   3.61        28.88